open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
/* SPDX-License-Identifier: Apache-2.0 */
/****************************************************************************
 * chips/bk7258/common/bk7258_os_adapt.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * BK7258 NuttX OS Adaptation Layer
 *
 * Bridges Beken SDK FreeRTOS API calls to NuttX equivalents so that the
 * prebuilt SDK libraries (libbk_wifi.a, libbk_rtos.a, etc.) can link and
 * run correctly on NuttX.
 *
 * Modelled after the BK7236N adaptation at
 *   armino/vendor_beken/chips/bk7236n/beken_os_adapt.c
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <inttypes.h>
#include <errno.h>
#include <malloc.h>
#include <stddef.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <assert.h>
#include <debug.h>
#include <pthread.h>
#include <sched.h>
#include <fcntl.h>
#include <unistd.h>
#include <clock/clock.h>
#include <sys/param.h>
#include <sys/time.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <syslog.h>
#include <irq/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/event.h>
#include <nuttx/mqueue.h>
#include <nuttx/mm/mm.h>
#include <nuttx/mutex.h>
#include <nuttx/queue.h>
#include <nuttx/semaphore.h>
#include <nuttx/kthread.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>
#include <nuttx/sched.h>
#include <nuttx/signal.h>
#include <nuttx/arch.h>
#include <nuttx/init.h>
#include <nuttx/tls.h>

#include <arch/chip/bk7258_console.h>
#include <arch/chip/bk7258_os_adapt.h>

#ifdef CONFIG_BK7258_PSRAM
#  include <arch/chip/bk7258_psram.h>
#endif

#include "os/os.h"
#include "os/mem.h"
#include "os/str.h"
#include "os/rtos_ext.h"

/* Undef SDK macros that conflict with our function definitions.
 * os/mem.h defines os_malloc/os_free/psram_malloc etc. as macros
 * redirecting to *_debug variants. We need real function definitions
 * for the prebuilt libraries to link against.
 */
#ifdef os_malloc
#undef os_malloc
#endif
#ifdef os_free
#undef os_free
#endif
#ifdef os_zalloc
#undef os_zalloc
#endif
#ifdef os_sram_malloc
#undef os_sram_malloc
#endif
#ifdef os_sram_calloc
#undef os_sram_calloc
#endif
#ifdef os_sram_zalloc
#undef os_sram_zalloc
#endif
#ifdef psram_malloc
#undef psram_malloc
#endif
#ifdef psram_zalloc
#undef psram_zalloc
#endif
#ifdef rtos_get_ms_per_tick
#undef rtos_get_ms_per_tick
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BEKEN_WAIT_FOREVER  (0xFFFFFFFF)

/* The official FreeRTOS port dispatches software-timer callbacks from its
 * highest-priority timer daemon task, never from the tick ISR.  Keep the same
 * contract here: the watchdog only timestamps an expiry and a board-owned
 * kthread invokes the SDK callback.  The 3072-byte stack matches Beken's
 * configTIMER_TASK_STACK_DEPTH setting.
 */

#define BK7258_TIMER_SERVICE_NAME       "bk-sdk-timer"
#define BK7258_TIMER_SERVICE_PRIORITY   (SCHED_PRIORITY_DEFAULT + 10)
#define BK7258_TIMER_SERVICE_STACKSIZE  3072

/* Official v3.1.1.9 AP sdkconfig value.  NuttX owns the actual allocation;
 * this is only the requested stack size passed through the SDK static-task
 * compatibility entry points.
 */

#define BK7258_EVENT_TASK_STACKSIZE   3072u

#define BK7258_SDK_THREAD_ARG_BUFSIZE (2u + sizeof(uintptr_t) * 2u + 1u)

#ifdef CONFIG_BK7258_AP_CORE
#  define BK7258_SDK_ARG_THREAD_NAME "dvp_work_thread"
#else
#  define BK7258_SDK_ARG_THREAD_NAME "tempd"
#endif


#ifndef CONFIG_BK7258_AP_CORE
/* Bluetooth uses bk_get_printf_port() to avoid deinitializing an active UART
 * console when temporary DUT ownership is released.  Report the selected
 * board console, or retain the SDK port when RTT/NONE owns diagnostics.
 */

#  ifdef BK7258_HAVE_UART_CONSOLE
#    define BK7258_NUTTX_CONSOLE_UART_PORT BK7258_CONSOLE_UART_ID
#  else
#    define BK7258_NUTTX_CONSOLE_UART_PORT CONFIG_UART_PRINT_PORT
#  endif
#endif

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
#  define BK7258_OS_SDK_LOCK_FREE 0xf2eef2eeu
#  define BK7258_OS_SDK_LOCK_MAX_NEST 0xffu
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Timer adapter - bridges Beken timer to NuttX watchdog */

struct timer_adpt
{
  sq_entry_t    queue;             /* Timer-service queue linkage */
  struct wdog_s wdog;              /* NuttX watchdog handle */
  bool          repeat;            /* True if periodic timer */
  bool          enabled;           /* Logical SDK active state */
  bool          queued;            /* Queued to timer service */
  bool          deliver_pending;   /* Deliver the expired callback */
  bool          callback_running;  /* SDK callback is executing */
  bool          restart_pending;   /* Arm after queued/running callback */
  bool          delete_pending;    /* Free only in timer-service context */
  uint32_t      delay;             /* Timeout in ticks */
  void          *priv;             /* beken_timer_t / beken2_timer_t */
};

