open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
/* Counting semaphore adapter.  NuttX sem_t has no maximum count, while the
 * SDK contract is FreeRTOS xSemaphoreCreateCounting().  Keep the limit and a
 * small posting lock beside the native semaphore so concurrent producers
 * cannot overrun a binary semaphore with stale tokens.
 */

struct sem_adpt_s
{
  sem_t      sem;
  spinlock_t lock;
  int        max_count;
  int        count;
  uint16_t   waiters;
};

/* Message queue adapter.  A NuttX POSIX mqueue orders equal-priority messages
 * FIFO and therefore cannot implement xQueueSendToFront() exactly.  Use a
 * bounded board-local deque with semaphore wake hints and spinlock-protected
 * state; every operation rechecks the state, so reset remains atomic with
 * concurrent producers and consumers even when a wake hint is stale.
 */

struct mq_adpt_s
{
  spinlock_t lock;
  sem_t      not_empty;
  sem_t      not_full;
  bool       not_empty_initialized;
  bool       not_full_initialized;
  bool       shutting_down;
  FAR uint8_t *messages;
  uint32_t   msgsize;
  uint32_t   capacity;
  uint32_t   head;
  uint32_t   count;
  uint16_t   get_waiters;
  uint16_t   put_waiters;
  char       cname[32];
};

struct bk7258_sdk_thread_start_s
{
  beken_thread_function_t function;
  beken_thread_arg_t arg;
};

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
/* Match the SDK SMP implementation of rtos_enter_critical(): first mask
 * interrupts on the current core, then serialize callers across cores with
 * a dedicated recursive-by-core lock.  The SDK spinlock is not equivalent to
 * NuttX spinlock_t: it records owner + nesting count, and SDK drivers legally
 * nest critical sections on one core.  This lock must remain independent
 * from NuttX's scheduler lock because rtos_disable_int() is an interrupt-mask
 * API, not a NuttX scheduler critical section.
 */

struct bk7258_os_sdk_lock_s
{
  uint32_t owner;
  uint32_t count;
};

static volatile struct bk7258_os_sdk_lock_s
  g_bk7258_sdk_critical_lock =
{
  .owner = BK7258_OS_SDK_LOCK_FREE,
  .count = 0
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static volatile bool g_bk7258_sdk_printf_enabled = true;
static sq_queue_t g_bk7258_timer_queue;
static sem_t g_bk7258_timer_sem = SEM_INITIALIZER(0);
static mutex_t g_bk7258_timer_init_lock = NXMUTEX_INITIALIZER;
static pid_t g_bk7258_timer_service_pid = -1;

#ifdef CONFIG_BK7258_BT_IPC
/* The immutable CP and AP BT IPC objects each create one long-lived binary
 * semaphore during bt_ipc_init().  Keep those objects out of the packet
 * heaps: a first raw-pointer HCI allocation can otherwise alias the matching
 * semaphore during the cold generation-1 startup sequence.  The init-scope
 * flag is asserted only around bt_ipc_init(), so every other SDK semaphore
 * keeps normal NuttX heap ownership.
 */

static struct sem_adpt_s g_bk7258_bt_ipc_send_sem;
static bool g_bk7258_bt_ipc_init_scope;
static bool g_bk7258_bt_ipc_send_sem_active;
static pid_t g_bk7258_bt_ipc_init_pid;

/* BT IPC exchanges heap pointers between processors and returns ownership
 * with HCI_FREE_PKT.  Keep a small, allocation-free tracker around that
 * narrow SDK call path while Wi-Fi/BT coexistence is being brought up.  It
 * turns a stale or duplicate cross-core free into evidence instead of
 * allowing the NuttX heap free list to be corrupted first.
 */

#define BK7258_BT_HEAP_TRACK_MAGIC  0x42544850u /* "BTHP" */
#define BK7258_BT_HEAP_TRACK_SLOTS  32u

struct bk7258_bt_heap_track_entry_s
{
  void    *pointer;
  uint32_t size;
  uint32_t alloc_line;
  uint32_t free_line;
  uint32_t alloc_sequence;
  uint32_t free_sequence;
  bool     active;
};

struct bk7258_bt_heap_track_s
{
  uint32_t magic;
  uint32_t sequence;
  uint32_t active;
  uint32_t high_water;
  uint32_t invalid_frees;
  uint32_t duplicate_allocations;
  void    *last_invalid_pointer;
  uint32_t last_invalid_line;
  struct bk7258_bt_heap_track_entry_s
    entries[BK7258_BT_HEAP_TRACK_SLOTS];
};

struct bk7258_bt_heap_track_s g_bk7258_bt_heap_track =
{
  .magic = BK7258_BT_HEAP_TRACK_MAGIC
};
#endif

/* The official BK7258 SMP SDK implements port_disable_interrupts_flag() with
 * PRIMASK (__get_PRIMASK() + __disable_irq()) and restores the saved PRIMASK
 * verbatim.  NuttX up_irq_save() uses BASEPRI on ARMv8-M, so use the exact
 * SDK contract here instead of substituting enter_critical_section().
 */

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
static inline irqstate_t bk7258_os_local_irq_save(void)
{
  irqstate_t flags;

  __asm volatile
    (
      "mrs %0, primask\n"
      "cpsid i\n"
      : "=r" (flags)
      :
      : "memory"
    );

  return flags;
}

static inline void bk7258_os_local_irq_restore(irqstate_t flags)
{
  __asm volatile
    (
      "msr primask, %0\n"
      :
      : "r" (flags)
      : "memory"
    );
}

static void bk7258_os_sdk_lock(void)
{
  uint32_t cpu = (uint32_t)up_cpu_index();
  uint32_t expected;
  uint32_t owner;

  for (;;)
    {
      owner = __atomic_load_n(&g_bk7258_sdk_critical_lock.owner,
                              __ATOMIC_ACQUIRE);
      if (owner == cpu)
        {
          /* Local PRIMASK is already set, so another context on this core
           * cannot race the recursive count update.
           */

          DEBUGASSERT(g_bk7258_sdk_critical_lock.count > 0 &&
                      g_bk7258_sdk_critical_lock.count <
                        BK7258_OS_SDK_LOCK_MAX_NEST);
          g_bk7258_sdk_critical_lock.count++;
          return;
        }

      if (owner == BK7258_OS_SDK_LOCK_FREE)
        {
          expected = BK7258_OS_SDK_LOCK_FREE;
          if (__atomic_compare_exchange_n(
                &g_bk7258_sdk_critical_lock.owner, &expected, cpu, false,
                __ATOMIC_ACQUIRE, __ATOMIC_RELAXED))
            {
              g_bk7258_sdk_critical_lock.count = 1;
              __asm volatile ("dmb sy" ::: "memory");
              return;
            }
        }

      /* Match the SDK spin_lock() wait model.  The owner releases with SEV,
       * so this does not consume CPU while the other AP core owns the lock.
       */

      __asm volatile ("wfe" ::: "memory");
    }
}

static void bk7258_os_sdk_unlock(void)
{
  uint32_t cpu = (uint32_t)up_cpu_index();

  DEBUGASSERT(__atomic_load_n(&g_bk7258_sdk_critical_lock.owner,
                              __ATOMIC_RELAXED) == cpu);
  DEBUGASSERT(g_bk7258_sdk_critical_lock.count > 0 &&
              g_bk7258_sdk_critical_lock.count <=
                BK7258_OS_SDK_LOCK_MAX_NEST);

  g_bk7258_sdk_critical_lock.count--;
  if (g_bk7258_sdk_critical_lock.count == 0)
    {
      __atomic_store_n(&g_bk7258_sdk_critical_lock.owner,
                       BK7258_OS_SDK_LOCK_FREE, __ATOMIC_RELEASE);
      __asm volatile ("dsb sy; sev" ::: "memory");
    }
}
#endif

static void bk7258_os_delay_ms(uint32_t milliseconds)
{
  /* NuttX must never block the IDLE task.  SDK clock/UART setup can request
   * delays from up_initialize(), before nx_bringup() has created any other
   * runnable task.  Use an architecture busy wait until normal scheduling is
   * active, and whenever this adapter is called from IDLE or interrupt context.
   */

  if (!OSINIT_IDLELOOP() ||
      nxsched_gettid() == IDLE_PROCESS_ID ||
      up_interrupt_context())
    {
      up_mdelay(milliseconds);
    }
  else
    {
      nxsig_usleep(milliseconds * 1000u);
    }
}

static inline bk_err_t beken_errno_trans(int ret)
{
  if (!ret)
    {
      return BK_OK;
    }

