open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
  return BK_FAIL;
}

/* All state and queue changes below are serialized with NuttX's scheduler
 * critical section.  wd_timer() already holds that recursive lock while it
 * invokes bk7258_timer_expiry(), which also makes the object lifetime safe
 * on the AP SMP image.
 */

static void bk7258_timer_expiry(wdparm_t arg);

static void bk7258_timer_queue_locked(struct timer_adpt *timer_apt,
                                      bool deliver)
{
  timer_apt->deliver_pending |= deliver;
  if (!timer_apt->queued)
    {
      timer_apt->queued = true;
      sq_addlast(&timer_apt->queue, &g_bk7258_timer_queue);
      (void)nxsem_post(&g_bk7258_timer_sem);
    }
}

static int bk7258_timer_start_locked(struct timer_adpt *timer_apt)
{
  int ret;

  if (WDOG_ISACTIVE(&timer_apt->wdog))
    {
      (void)wd_cancel(&timer_apt->wdog);
    }

  ret = wd_start(&timer_apt->wdog, timer_apt->delay,
                 bk7258_timer_expiry, (wdparm_t)timer_apt);
  if (ret == OK)
    {
      timer_apt->restart_pending = false;
    }
  else
    {
      timer_apt->enabled = false;
    }

  return ret;
}

static void bk7258_timer_expiry(wdparm_t arg)
{
  struct timer_adpt *timer_apt = (struct timer_adpt *)arg;
  irqstate_t flags;

  flags = enter_critical_section();

  if (!timer_apt->delete_pending && timer_apt->enabled)
    {
      /* A one-shot becomes inactive at expiry.  A periodic timer remains
       * logically active and is rearmed by the service before its callback,
       * matching the official FreeRTOS timer-daemon cadence.
       */

      if (!timer_apt->repeat)
        {
          timer_apt->enabled = false;
        }

      bk7258_timer_queue_locked(timer_apt, true);
    }

  leave_critical_section(flags);
}

static int bk7258_timer_service(int argc, char *argv[])
{
  (void)argc;
  (void)argv;

  for (;;)
    {
      struct timer_adpt *timer_apt;
      timer_handler_t periodic = NULL;
      timer_2handler_t oneshot = NULL;
      void *arg = NULL;
      void *left_arg = NULL;
      void *right_arg = NULL;
      sq_entry_t *entry;
      irqstate_t flags;
      bool deliver;
      bool free_timer = false;

      (void)nxsem_wait_uninterruptible(&g_bk7258_timer_sem);

      flags = enter_critical_section();
      entry = sq_remfirst(&g_bk7258_timer_queue);
      if (entry == NULL)
        {
          leave_critical_section(flags);
          continue;
        }

      /* queue is the first member of timer_adpt. */

      timer_apt = (struct timer_adpt *)entry;
      timer_apt->queued = false;

      if (timer_apt->delete_pending)
        {
          free_timer = true;
          deliver = false;
        }
      else
        {
          deliver = timer_apt->deliver_pending;
          timer_apt->deliver_pending = false;

          if (deliver)
            {
              timer_apt->callback_running = true;
              if (timer_apt->repeat)
                {
                  beken_timer_t *timer = timer_apt->priv;

                  periodic = timer->function;
                  arg = timer->arg;

                  if (timer_apt->enabled)
                    {
                      (void)bk7258_timer_start_locked(timer_apt);
                    }
                }
              else
                {
                  beken2_timer_t *timer = timer_apt->priv;

                  if (timer->beken_magic == BEKEN_MAGIC_WORD)
                    {
                      oneshot = timer->function;
                      left_arg = timer->left_arg;
                      right_arg = timer->right_arg;
                    }
                }
            }
          else if (timer_apt->enabled && timer_apt->restart_pending)
            {
              /* A stop/reload raced an expiry already queued to this
               * service.  Suppress the stale callback and start the new
               * period from the explicit reload operation.
               */

              (void)bk7258_timer_start_locked(timer_apt);
            }
        }

      leave_critical_section(flags);

      if (free_timer)
        {
          kmm_free(timer_apt);
          continue;
        }

      if (periodic != NULL)
        {
          periodic(arg);
        }
      else if (oneshot != NULL)
        {
          oneshot(left_arg, right_arg);
        }

      if (deliver)
        {
          flags = enter_critical_section();
          timer_apt->callback_running = false;

          if (timer_apt->delete_pending)
            {
              /* A periodic timer can expire again while its callback runs.
               * In that case the queued delete entry owns the final free;
               * freeing here would leave a dangling timer-service node.
               */

              if (!timer_apt->queued)
                {
                  free_timer = true;
                }
            }
          else if (timer_apt->enabled && timer_apt->restart_pending)
            {
              /* One-shot callbacks and periodic callbacks that explicitly
               * reload/retime themselves defer the new arm until the old
               * callback has returned.
               */

              (void)bk7258_timer_start_locked(timer_apt);
            }

          leave_critical_section(flags);

          if (free_timer)
            {
              kmm_free(timer_apt);
            }
        }
    }

  return EXIT_SUCCESS;
}

static int bk7258_timer_service_initialize(void)
{
  int ret;
  pid_t pid;

  ret = nxmutex_lock(&g_bk7258_timer_init_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_bk7258_timer_service_pid > 0)
    {
      nxmutex_unlock(&g_bk7258_timer_init_lock);
      return OK;
    }

  pid = kthread_create(BK7258_TIMER_SERVICE_NAME,
                       BK7258_TIMER_SERVICE_PRIORITY,
                       BK7258_TIMER_SERVICE_STACKSIZE,
                       bk7258_timer_service, NULL);
  if (pid <= 0)
    {
      nxmutex_unlock(&g_bk7258_timer_init_lock);
      return pid < 0 ? (int)pid : -ENOMEM;
    }

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  {
    cpu_set_t cpuset = (cpu_set_t)1u;

