open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
    /* The AP's SDK-facing services are owned by logical CPU0. */

    ret = sched_setaffinity(pid, sizeof(cpuset), &cpuset);
    if (ret < 0)
      {
        wlerr("WARN: Failed to pin SDK timer service: %d\n", ret);
      }
  }
#endif

  g_bk7258_timer_service_pid = pid;
  nxmutex_unlock(&g_bk7258_timer_init_lock);
  return OK;
}

static void bk7258_timer_delete_locked(struct timer_adpt *timer_apt)
{
  timer_apt->enabled = false;
  timer_apt->deliver_pending = false;
  timer_apt->restart_pending = false;
  timer_apt->delete_pending = true;

  if (WDOG_ISACTIVE(&timer_apt->wdog))
    {
      (void)wd_cancel(&timer_apt->wdog);
    }

  if (!timer_apt->queued && !timer_apt->callback_running)
    {
      bk7258_timer_queue_locked(timer_apt, false);
    }
}

/****************************************************************************
 * Public Functions - Interrupt Management
 ****************************************************************************/

uint32_t rtos_disable_int(void)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  return (uint32_t)bk7258_os_local_irq_save();
#else
  return enter_critical_section();
#endif
}

void rtos_enable_int(uint32_t int_level)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  bk7258_os_local_irq_restore((irqstate_t)int_level);
#else
  leave_critical_section(int_level);
#endif
}

/* These two entry points are part of the SDK ARM_CM33 port ABI.  Unlike
 * NuttX's normal critical-section API, the SDK contract saves and restores
 * PRIMASK verbatim.  Controller and exception objects call them directly.
 */

int port_disable_interrupts_flag(void)
{
  irqstate_t flags;

  __asm volatile
    (
      "mrs %0, primask\n"
      "cpsid i\n"
      : "=r" (flags)
      :
      : "memory"
    );

  return (int)flags;
}

void port_enable_interrupts_flag(int int_level)
{
  __asm volatile
    (
      "msr primask, %0\n"
      :
      : "r" ((irqstate_t)int_level)
      : "memory"
    );
}

uint32_t rtos_enter_critical(void)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  irqstate_t flags = bk7258_os_local_irq_save();

  bk7258_os_sdk_lock();
  return (uint32_t)flags;
#else
  return enter_critical_section();
#endif
}

void rtos_exit_critical(uint32_t int_level)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  bk7258_os_sdk_unlock();
  bk7258_os_local_irq_restore((irqstate_t)int_level);
#else
  leave_critical_section(int_level);
#endif
}

uint32_t rtos_before_sleep(void)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  return rtos_disable_int();
#else
  return enter_critical_section();
#endif
}

void rtos_after_sleep(uint32_t int_level)
{
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  rtos_enable_int(int_level);
#else
  leave_critical_section(int_level);
#endif
}

/****************************************************************************
 * Public Functions - Time
 ****************************************************************************/

bk_err_t beken_time_get_time(beken_time_t *time_ptr)
{
  struct timespec ts;

  clock_systime_timespec(&ts);
  *time_ptr = ts.tv_sec * 1000 + ts.tv_nsec / 1000000;

  return BK_OK;
}

uint32_t rtos_get_time(void)
{
  struct timespec ts;

  clock_systime_timespec(&ts);

  return (uint32_t)(ts.tv_sec * 1000 + ts.tv_nsec / 1000000);
}

uint32_t beken_ms_per_tick(void)
{
  return MSEC_PER_TICK;
}

uint32_t rtos_get_tick_count(void)
{
  return (uint32_t)clock_systime_ticks();
}

uint32_t xTaskGetTickCount(void)
{
  return (uint32_t)clock_systime_ticks();
}

uint64_t bk_get_tick(void)
{
  return (uint64_t)clock_systime_ticks();
}

uint32_t bk_get_ticks_per_second(void)
{
  return 1000000 / CONFIG_USEC_PER_TICK;
}

uint32_t rtos_get_ms_per_tick(void)
{
  return MSEC_PER_TICK;
}

uint32_t bk_get_second(void)
{
  struct timespec ts;

  clock_systime_timespec(&ts);

  return (uint32_t)ts.tv_sec;
}

/****************************************************************************
 * Public Functions - Thread Management
 ****************************************************************************/

static int bk7258_sdk_thread_trampoline(int argc, FAR char *argv[])
{
  FAR struct bk7258_sdk_thread_start_s *start;
  beken_thread_function_t function;
  beken_thread_arg_t arg;
  FAR char *end;
  uintptr_t address;

  if (argc != 2 || argv == NULL || argv[1] == NULL)
    {
      wlerr("ERROR: SDK thread trampoline received invalid arguments\n");
      return -EINVAL;
    }

  errno = 0;
  address = (uintptr_t)strtoull(argv[1], &end, 16);
  if (errno != 0 || end == argv[1] || *end != '\0' || address == 0)
    {
      wlerr("ERROR: SDK thread trampoline received invalid context\n");
      return -EINVAL;
    }

  start = (FAR struct bk7258_sdk_thread_start_s *)address;
  function = start->function;
  arg = start->arg;
  kmm_free(start);

  if (function == NULL)
    {
      return -EINVAL;
    }

  function(arg);
  return 0;
}

bk_err_t rtos_create_thread(beken_thread_t *thread, uint8_t priority,
                            const char *name,
                            beken_thread_function_t function,
                            uint32_t stack_size, beken_thread_arg_t arg)
{
  FAR struct bk7258_sdk_thread_start_s *start = NULL;
  char context[BK7258_SDK_THREAD_ARG_BUFSIZE];
  FAR char *argv[] = {context, NULL};
  pid_t pid;

  if (name == NULL || function == NULL || stack_size == 0)
    {
      return BK_FAIL;
    }

  /* Keep the verified no-argument path unchanged.  Exactly one immutable
   * v3.1.1.9 call site per role is allowed to cross the NuttX main_t boundary
   * with a context: AP's DVP worker, or CP's temperature daemon.  The latter
   * receives the OTP temperature code as its non-NULL argument.  Do not
   * generalize this bridge: the SDK IPC worker has an incompatible semaphore
   * ABI and was observed to fault in nxsem_wait_slow.  Every other non-NULL
   * argument retains fail-closed behavior.
   */

  if (arg == NULL)
    {
      pid = kthread_create(name,
                           SCHED_PRIORITY_DEFAULT + 2 - priority,
                           stack_size,
                           (main_t)function, NULL);
    }
  else if (strcmp(name, BK7258_SDK_ARG_THREAD_NAME) == 0)
    {
      start = kmm_malloc(sizeof(*start));
      if (start == NULL)
        {
          return BK_FAIL;
        }

      start->function = function;
      start->arg = arg;
      snprintf(context, sizeof(context), "%" PRIxPTR, (uintptr_t)start);
      pid = kthread_create(name,
                           SCHED_PRIORITY_DEFAULT + 2 - priority,
                           stack_size,
                           bk7258_sdk_thread_trampoline, argv);
    }
  else
    {
      wlerr("Task(%s)'s arg is NOT NULL\n", name);
      pid = -1;
    }

  if (pid <= 0)
    {
      if (start != NULL)
        {
          kmm_free(start);
        }

      wlerr("ERROR: Failed to create thread(%s): %d\n", name, pid);
      return BK_FAIL;
    }
  if (thread)
    {
      *thread = (void *)((uintptr_t)pid);
    }

  return BK_OK;
}

bk_err_t rtos_create_thread_static(beken_thread_t *thread, uint8_t priority,
                                   const char *name,
                                   beken_thread_function_t function,
                                   uint32_t stack_size,
                                   beken_thread_arg_t arg,
                                   void * const task_stack_buffer,
                                   void * const task_tcb_buffer,
                                   uint32_t core_id)
{
  bk_err_t ret;

  /* StaticTask_t and StackType_t are FreeRTOS-private storage types.  NuttX
   * owns its TCB and stack allocation, so the compatibility ABI intentionally
   * ignores those buffers while preserving the SDK-requested stack size.
   */

  (void)task_stack_buffer;
  (void)task_tcb_buffer;

  ret = rtos_create_thread(thread, priority, name, function, stack_size, arg);
  if (ret != BK_OK)
    {
      return ret;
    }

