open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  if (thread != NULL && core_id < CONFIG_SMP_NCPUS)
    {
      cpu_set_t cpuset = (cpu_set_t)1u << core_id;
      pid_t pid = (pid_t)(uintptr_t)*thread;

      if (sched_setaffinity(pid, sizeof(cpuset), &cpuset) < 0)
        {
          task_delete(pid);
          *thread = NULL;
          return BK_FAIL;
        }
    }
#else
  (void)core_id;
#endif

  return BK_OK;
}

#ifdef CONFIG_BK7258_AP_CORE
void rtos_get_event_task_memory(void **task_tcb_buffer,
                                void **task_stack_buffer,
                                uint32_t *stack_size)
{
  /* See rtos_create_thread_static(): the two FreeRTOS storage pointers are
   * ABI placeholders only; the size remains the official AP v3.1.1.9 value.
   */

  if (task_tcb_buffer != NULL)
    {
      *task_tcb_buffer = NULL;
    }

  if (task_stack_buffer != NULL)
    {
      *task_stack_buffer = NULL;
    }

  if (stack_size != NULL)
    {
      *stack_size = BK7258_EVENT_TASK_STACKSIZE;
    }
}
#endif

bk_err_t rtos_smp_create_thread(beken_thread_t *thread, uint8_t priority,
                                const char *name,
                                beken_thread_function_t function,
                                uint32_t stack_size,
                                beken_thread_arg_t arg)
{
  beken_thread_t created = NULL;
  bk_err_t ret;

  ret = rtos_create_thread(&created, priority, name, function, stack_size,
                           arg);
  if (ret != BK_OK)
    {
      return ret;
    }

#if defined(CONFIG_BK7258_AP_CORE) && defined(CONFIG_SMP)
  {
    cpu_set_t cpuset = (cpu_set_t)1u;
    pid_t pid = (pid_t)(uintptr_t)created;

    /* Vendor AP Wi-Fi callbacks and mailbox queues have one logical owner.
     * Keep them on AP logical CPU0 while native NuttX networking remains
     * free to schedule its own work on either logical CPU.
     */

    if (sched_setaffinity(pid, sizeof(cpuset), &cpuset) < 0)
      {
        wlerr("ERROR: Failed to pin SDK thread(%s) to AP CPU0\n", name);
        task_delete(pid);
        return BK_FAIL;
      }
  }
#endif

  if (thread)
    {
      *thread = created;
    }

  return BK_OK;
}

bk_err_t rtos_create_sram_thread(beken_thread_t *thread, uint8_t priority,
                                 const char *name,
                                 beken_thread_function_t function,
                                 uint32_t stack_size,
                                 beken_thread_arg_t arg)
{
  return rtos_create_thread(thread, priority, name, function,
                            stack_size, arg);
}

bk_err_t rtos_create_psram_thread(beken_thread_t *thread,
                                  uint8_t priority,
                                  const char *name,
                                  beken_thread_function_t function,
                                  uint32_t stack_size,
                                  beken_thread_arg_t arg)
{
  return rtos_create_thread(thread, priority, name, function,
                            stack_size, arg);
}

bk_err_t rtos_thread_set_priority(beken_thread_t *thread, int priority)
{
  struct sched_param param;
  pid_t pid;

  pid = thread ? (pid_t)(uintptr_t)*thread : nxsched_gettid();
  param.sched_priority = SCHED_PRIORITY_DEFAULT + 2 - priority;

  return sched_setparam(pid, &param) == OK ? BK_OK : BK_FAIL;
}

bk_err_t rtos_delete_thread(beken_thread_t *thread)
{
  pid_t pid = 0;

  if (thread)
    {
      pid = (pid_t)((uintptr_t)*thread);
    }

  task_delete(pid);

  return BK_OK;
}

bool rtos_is_current_thread(beken_thread_t *thread)
{
  pid_t tid = nxsched_gettid();

  return thread != NULL && tid == (pid_t)(uintptr_t)*thread;
}

beken_thread_t *rtos_get_current_thread(void)
{
  return (beken_thread_t *)(uintptr_t)nxsched_gettid();
}

bk_err_t rtos_thread_join(beken_thread_t *thread)
{
  pid_t pid;

  if (thread == NULL || *thread == NULL)
    {
      return BK_ERR_PARAM;
    }

  pid = (pid_t)(uintptr_t)*thread;

#ifdef CONFIG_SCHED_WAITPID
  /* Prefer the kernel join path when the caller is the creating task.  SDK
   * components also join worker handles from a different service task; in
   * that case NuttX reports -ECHILD and the v3.1.1.9-compatible finished
   * polling below supplies the required cross-task semantics.
   */

  if (nxsched_waitpid(pid, NULL, 0) == pid)
    {
      *thread = NULL;
      return BK_OK;
    }
#endif

  for (; ; )
    {
      FAR struct tcb_s *tcb = nxsched_get_tcb(pid);
      int ret;

      if (tcb == NULL)
        {
          break;
        }

      nxsched_put_tcb(tcb);
      ret = nxsig_usleep(10000u);
      if (ret < 0 && ret != -EINTR)
        {
          return BK_FAIL;
        }
    }

  *thread = NULL;
  return BK_OK;
}

bk_err_t rtos_thread_force_awake(beken_thread_t *thread)
{
  /* Not fully implemented - stub */

  return BK_OK;
}

void rtos_suspend_thread(beken_thread_t *thread)
{
  /* Stub - not fully supported */
}

void rtos_suspend_all_thread(void)
{
  sched_lock();
}

void rtos_resume_thread(beken_thread_t *thread)
{
  /* Stub - not fully supported */
}

void rtos_resume_all_thread(void)
{
  sched_unlock();
}

void rtos_thread_sleep(uint32_t seconds)
{
  sleep(seconds);
}

void rtos_thread_msleep(uint32_t milliseconds)
{
  bk7258_os_delay_ms(milliseconds);
}

bk_err_t rtos_print_thread_status(char *buffer, int length)
{
  /* Stub */

  return BK_OK;
}

/****************************************************************************
 * Public Functions - Semaphore
 ****************************************************************************/

bk_err_t rtos_init_semaphore(beken_semaphore_t *semaphore, int max_count)
{
  struct sem_adpt_s *adapter;
  int ret;

  if (semaphore == NULL || max_count <= 0 || max_count > INT16_MAX)
    {
      return semaphore == NULL ? BK_ERR_NULL_PARAM : BK_ERR_PARAM;
    }

  adapter = kmm_zalloc(sizeof(*adapter));
  if (adapter == NULL)
    {
      wlerr("ERROR: Failed to malloc semaphore\n");
      return BK_FAIL;
    }

