open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
  adapter->max_count = max_count;
  adapter->count = 0;
  ret = nxsem_init(&adapter->sem, 0, 0);
  if (ret == OK)
    {
      *semaphore = adapter;
    }
  else
    {
      wlerr("ERROR: Failed to create semaphore:%d\n", ret);
      kmm_free(adapter);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_init_semaphore_ex(beken_semaphore_t *semaphore,
                                int max_count, int init_count)
{
  struct sem_adpt_s *adapter = NULL;
  int ret;

  if (semaphore == NULL || max_count <= 0 || max_count > INT16_MAX ||
      init_count < 0 || init_count > max_count)
    {
      return semaphore == NULL ? BK_ERR_NULL_PARAM : BK_ERR_PARAM;
    }
#ifdef CONFIG_BK7258_BT_IPC
  bool static_sem = false;
  bool expected = false;

  if (max_count == 1 && init_count == 1 &&
      __atomic_load_n(&g_bk7258_bt_ipc_init_scope, __ATOMIC_ACQUIRE) &&
      __atomic_load_n(&g_bk7258_bt_ipc_init_pid, __ATOMIC_RELAXED) ==
        nxsched_gettid() &&
      __atomic_compare_exchange_n(&g_bk7258_bt_ipc_send_sem_active,
                                  &expected, true, false,
                                  __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
    {
      adapter = &g_bk7258_bt_ipc_send_sem;
      static_sem = true;
    }
#endif

  if (adapter == NULL)
    {
      adapter = kmm_zalloc(sizeof(*adapter));
    }

  if (adapter == NULL)
    {
      wlerr("ERROR: Failed to malloc semaphore\n");
      return BK_FAIL;
    }

  adapter->max_count = max_count;
  adapter->count = init_count;
  /* adapter->count is the single source of truth.  The native semaphore is
   * only a condition-variable-style wake channel; mirroring init_count into
   * both objects would let a fast taker steal a token already assigned to a
   * sleeping waiter.
   */

  ret = nxsem_init(&adapter->sem, 0, 0);
  if (ret == OK)
    {
      *semaphore = adapter;
    }
  else
    {
      wlerr("ERROR: Failed to create semaphore:%d\n", ret);
#ifdef CONFIG_BK7258_BT_IPC
      if (static_sem)
        {
          __atomic_store_n(&g_bk7258_bt_ipc_send_sem_active, false,
                           __ATOMIC_RELEASE);
        }
      else
#endif
        {
          kmm_free(adapter);
        }
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_set_semaphore(beken_semaphore_t *semaphore)
{
  struct sem_adpt_s *adapter;
  irqstate_t flags;
  bool wake = false;
  int ret;

  if (semaphore == NULL || *semaphore == NULL)
    {
      return BK_ERR_NOT_INIT;
    }

  adapter = (struct sem_adpt_s *)*semaphore;
  flags = spin_lock_irqsave(&adapter->lock);
  if (adapter->count >= adapter->max_count)
    {
      ret = -EOVERFLOW;
    }
  else
    {
      adapter->count++;
      wake = adapter->waiters != 0;
      ret = OK;
    }

  spin_unlock_irqrestore(&adapter->lock, flags);
  if (wake)
    {
      ret = nxsem_post(&adapter->sem);
    }

  if (ret != OK)
    {
      wlerr("ERROR: Failed to post semaphore:%d\n", ret);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_get_semaphore(beken_semaphore_t *semaphore,
                            uint32_t timeout_ms)
{
  struct sem_adpt_s *adapter;
  clock_t elapsed;
  clock_t limit;
  clock_t start;
  irqstate_t flags;
  int ret;

  if (semaphore == NULL || *semaphore == NULL)
    {
      return BK_ERR_NOT_INIT;
    }

  adapter = (struct sem_adpt_s *)*semaphore;
  start = clock_systime_ticks();

  for (; ; )
    {
      flags = spin_lock_irqsave(&adapter->lock);
      if (adapter->count > 0)
        {
          adapter->count--;
          spin_unlock_irqrestore(&adapter->lock, flags);
          return BK_OK;
        }

      if (timeout_ms == 0 || up_interrupt_context())
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EAGAIN);
        }

      if (adapter->waiters == UINT16_MAX)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EOVERFLOW);
        }

      adapter->waiters++;
      spin_unlock_irqrestore(&adapter->lock, flags);

      if (timeout_ms == BEKEN_WAIT_FOREVER)
        {
          ret = nxsem_wait_uninterruptible(&adapter->sem);
        }
      else
        {
          limit = MSEC2TICK(timeout_ms);
          if (limit < 1)
            {
              limit = 1;
            }

          elapsed = clock_systime_ticks() - start;
          if (elapsed >= limit)
            {
              flags = spin_lock_irqsave(&adapter->lock);
              adapter->waiters--;
              spin_unlock_irqrestore(&adapter->lock, flags);
              return beken_errno_trans(-ETIMEDOUT);
            }

          ret = nxsem_tickwait_uninterruptible(&adapter->sem,
                                               limit - elapsed);
        }

      flags = spin_lock_irqsave(&adapter->lock);
      adapter->waiters--;
      spin_unlock_irqrestore(&adapter->lock, flags);
      if (ret < 0)
        {
          wlerr("ERROR: Failed to get semaphore:%d\n", ret);
          return beken_errno_trans(ret);
        }

      /* A wake is only a hint: another CPU can consume the logical token
       * before this waiter runs.  Recheck adapter->count under the lock.
       */
    }
}

int rtos_get_semaphore_count(beken_semaphore_t *semaphore)
{
  struct sem_adpt_s *adapter;
  irqstate_t flags;
  int count;

  if (semaphore == NULL || *semaphore == NULL)
    {
      return 0;
    }

  adapter = (struct sem_adpt_s *)*semaphore;
  flags = spin_lock_irqsave(&adapter->lock);
  count = adapter->count;
  spin_unlock_irqrestore(&adapter->lock, flags);

  return count;
}

bk_err_t rtos_deinit_semaphore(beken_semaphore_t *semaphore)
{
  struct sem_adpt_s *adapter;
  int ret;

  if (semaphore == NULL || *semaphore == NULL)
    {
      return BK_OK;
    }

  adapter = (struct sem_adpt_s *)*semaphore;

  ret = nxsem_destroy(&adapter->sem);
  if (ret != OK)
    {
      wlerr("ERROR: Failed to destroy semaphore:%d\n", ret);
      return beken_errno_trans(ret);
    }

#ifdef CONFIG_BK7258_BT_IPC
  if (adapter == &g_bk7258_bt_ipc_send_sem)
    {
      __atomic_store_n(&g_bk7258_bt_ipc_send_sem_active, false,
                       __ATOMIC_RELEASE);
    }
  else
#endif
    {
      kmm_free(adapter);
    }

  *semaphore = NULL;

  return BK_OK;
}

#ifdef CONFIG_BK7258_BT_IPC
void bk7258_os_bt_ipc_init_begin(void)
{
  __atomic_store_n(&g_bk7258_bt_ipc_init_pid, nxsched_gettid(),
                   __ATOMIC_RELAXED);
  __atomic_store_n(&g_bk7258_bt_ipc_init_scope, true, __ATOMIC_RELEASE);
}

void bk7258_os_bt_ipc_init_end(void)
{
  __atomic_store_n(&g_bk7258_bt_ipc_init_scope, false, __ATOMIC_RELEASE);
  __atomic_store_n(&g_bk7258_bt_ipc_init_pid, 0, __ATOMIC_RELAXED);
}
#endif

/* The immutable SDK lwIP port uses FreeRTOS binary-semaphore creation only
 * for its per-thread socket semaphore.  Map that narrow ABI to the same
 * NuttX semaphore object used by the normal rtos_* wrapper; reject any wider
 * FreeRTOS queue request instead of linking the SDK FreeRTOS kernel.
 */

