open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
void *xQueueGenericCreate(uint32_t length, uint32_t item_size,
                          uint8_t queue_type)
{
  beken_semaphore_t sem = NULL;

  (void)queue_type;
  if (length != 1 || item_size != 0 ||
      rtos_init_semaphore(&sem, 1) != BK_OK)
    {
      return NULL;
    }

  return sem;
}

void *xQueueCreateMutex(uint8_t queue_type)
{
  beken_semaphore_t sem = NULL;

  (void)queue_type;
  if (rtos_init_semaphore_ex(&sem, 1, 1) != BK_OK)
    {
      return NULL;
    }

  return sem;
}

int xQueueSemaphoreTake(void *queue, uint32_t ticks_to_wait)
{
  beken_semaphore_t sem = queue;
  uint32_t timeout_ms = ticks_to_wait;

  if (ticks_to_wait == UINT32_MAX)
    {
      timeout_ms = BEKEN_WAIT_FOREVER;
    }

  return rtos_get_semaphore(&sem, timeout_ms) == BK_OK ? 1 : 0;
}

int xQueueGenericSend(void *queue, const void *item,
                      uint32_t ticks_to_wait, int copy_position)
{
  beken_semaphore_t sem = queue;

  (void)item;
  (void)ticks_to_wait;
  (void)copy_position;
  return rtos_set_semaphore(&sem) == BK_OK ? 1 : 0;
}

void vQueueDelete(void *queue)
{
  beken_semaphore_t sem = queue;

  if (sem)
    {
      (void)rtos_deinit_semaphore(&sem);
    }
}

/****************************************************************************
 * Public Functions - Mutex
 ****************************************************************************/

bk_err_t rtos_init_mutex(beken_mutex_t *mtx)
{
  int ret;
  mutex_t *mutex;

  mutex = kmm_malloc(sizeof(mutex_t));
  if (!mutex)
    {
      wlerr("ERROR: Failed to kmm_malloc\n");
      return BK_FAIL;
    }

  ret = nxmutex_init(mutex);
  if (ret == OK)
    {
      *mtx = mutex;
    }
  else
    {
      wlerr("ERROR: Failed to create mutex, ret:%d\n", ret);
      kmm_free(mutex);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_lock_mutex(beken_mutex_t *mtx)
{
  int ret;
  mutex_t *mutex = (mutex_t *)*mtx;

  ret = nxmutex_lock(mutex);
  if (ret != OK)
    {
      wlerr("ERROR: Failed to lock mutex:%d\n", ret);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_trylock_mutex(beken_mutex_t *mtx)
{
  int ret;
  mutex_t *mutex = (mutex_t *)*mtx;

  ret = nxmutex_trylock(mutex);

  return beken_errno_trans(ret);
}

bk_err_t rtos_lock_mutex_timeout(beken_mutex_t *mtx, uint32_t timeout_ms)
{
  int ret;
  mutex_t *mutex = (mutex_t *)*mtx;
  struct timespec ts;

  ts.tv_sec  = timeout_ms / 1000;
  ts.tv_nsec = (timeout_ms % 1000) * 1000000;

  ret = nxmutex_clocklock(mutex, CLOCK_MONOTONIC, &ts);

  return beken_errno_trans(ret);
}

bk_err_t rtos_unlock_mutex(beken_mutex_t *mtx)
{
  int ret;
  mutex_t *mutex = (mutex_t *)*mtx;

  ret = nxmutex_unlock(mutex);
  if (ret != OK)
    {
      wlerr("ERROR: Failed to unlock mutex:%d\n", ret);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_deinit_mutex(beken_mutex_t *mtx)
{
  mutex_t *mutex = (mutex_t *)*mtx;

  nxmutex_destroy(mutex);
  kmm_free(mutex);

  return BK_OK;
}

bk_err_t rtos_init_recursive_mutex(beken_mutex_t *mtx)
{
  FAR rmutex_t *mutex;
  int ret;

  if (mtx == NULL)
    {
      return BK_ERR_NULL_PARAM;
    }

  mutex = kmm_malloc(sizeof(*mutex));
  if (mutex == NULL)
    {
      return BK_FAIL;
    }

  ret = nxrmutex_init(mutex);
  if (ret < 0)
    {
      kmm_free(mutex);
      return beken_errno_trans(ret);
    }

  *mtx = mutex;
  return BK_OK;
}

bk_err_t rtos_lock_recursive_mutex(beken_mutex_t *mtx)
{
  if (mtx == NULL || *mtx == NULL)
    {
      return BK_ERR_NOT_INIT;
    }

  return beken_errno_trans(nxrmutex_lock((FAR rmutex_t *)*mtx));
}

bk_err_t rtos_unlock_recursive_mutex(beken_mutex_t *mtx)
{
  if (mtx == NULL || *mtx == NULL)
    {
      return BK_ERR_NOT_INIT;
    }

  return beken_errno_trans(nxrmutex_unlock((FAR rmutex_t *)*mtx));
}

bk_err_t rtos_deinit_recursive_mutex(beken_mutex_t *mtx)
{
  FAR rmutex_t *mutex;
  int ret;

  if (mtx == NULL || *mtx == NULL)
    {
      return BK_OK;
    }

  mutex = (FAR rmutex_t *)*mtx;
  ret = nxrmutex_destroy(mutex);
  if (ret < 0)
    {
      return beken_errno_trans(ret);
    }

  kmm_free(mutex);
  *mtx = NULL;
  return BK_OK;
}

/****************************************************************************
 * Public Functions - Message Queue
 ****************************************************************************/

static int bk7258_mq_wait_hint(FAR sem_t *sem, uint32_t timeout_ms,
                               clock_t start)
{
  clock_t elapsed;
  clock_t limit;

  if (up_interrupt_context() || timeout_ms == 0)
    {
      return -EAGAIN;
    }

  if (timeout_ms == BEKEN_WAIT_FOREVER)
    {
      return nxsem_wait_uninterruptible(sem);
    }

  limit = MSEC2TICK(timeout_ms);
  if (limit < 1)
    {
      limit = 1;
    }

  elapsed = clock_systime_ticks() - start;
  if (elapsed >= limit)
    {
      return -ETIMEDOUT;
    }

  return nxsem_tickwait_uninterruptible(sem, limit - elapsed);
}

static bk_err_t bk7258_mq_push(beken_queue_t *queue, FAR const void *message,
                               uint32_t timeout_ms, bool front)
{
  FAR struct mq_adpt_s *adapter;
  clock_t start;
  irqstate_t flags;
  bool wake;
  uint32_t index;
  int ret;

  if (queue == NULL || *queue == NULL || message == NULL)
    {
      return BK_ERR_PARAM;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  start = clock_systime_ticks();

  for (; ; )
    {
      flags = spin_lock_irqsave(&adapter->lock);
      if (adapter->shutting_down)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-ESHUTDOWN);
        }

      if (adapter->count < adapter->capacity)
        {
          if (front)
            {
              adapter->head = (adapter->head + adapter->capacity - 1u) %
                              adapter->capacity;
              index = adapter->head;
            }
          else
            {
              index = (adapter->head + adapter->count) % adapter->capacity;
            }

          memcpy(adapter->messages + (size_t)index * adapter->msgsize,
                 message, adapter->msgsize);
          adapter->count++;
          wake = adapter->get_waiters != 0;
          spin_unlock_irqrestore(&adapter->lock, flags);
          ret = wake ? nxsem_post(&adapter->not_empty) : OK;
          return beken_errno_trans(ret);
        }

      if (up_interrupt_context() || timeout_ms == 0)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EAGAIN);
        }

      if (adapter->put_waiters == UINT16_MAX)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EOVERFLOW);
        }

      adapter->put_waiters++;
      spin_unlock_irqrestore(&adapter->lock, flags);
      ret = bk7258_mq_wait_hint(&adapter->not_full, timeout_ms, start);
      flags = spin_lock_irqsave(&adapter->lock);
      adapter->put_waiters--;
      spin_unlock_irqrestore(&adapter->lock, flags);
      if (ret < 0)
        {
          return beken_errno_trans(ret);
        }
    }
}

