open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
bk_err_t rtos_init_queue(beken_queue_t *queue, const char *name,
                         uint32_t message_size,
                         uint32_t number_of_messages)
{
  FAR struct mq_adpt_s *adapter;
  size_t bytes;
  int ret;

  if (queue == NULL || message_size == 0 || number_of_messages == 0 ||
      number_of_messages > INT16_MAX ||
      message_size > SIZE_MAX / number_of_messages)
    {
      return BK_ERR_PARAM;
    }

  adapter = kmm_zalloc(sizeof(*adapter));
  if (adapter == NULL)
    {
      wlerr("ERROR: Failed to kmm_malloc\n");
      return BK_FAIL;
    }

  bytes = (size_t)message_size * number_of_messages;
  adapter->messages = kmm_malloc(bytes);
  if (adapter->messages == NULL)
    {
      kmm_free(adapter);
      return BK_FAIL;
    }

  adapter->msgsize = message_size;
  adapter->capacity = number_of_messages;
  strncpy(adapter->cname, name != NULL ? name : "null",
          sizeof(adapter->cname) - 1);

  ret = nxsem_init(&adapter->not_empty, 0, 0);
  if (ret >= 0)
    {
      adapter->not_empty_initialized = true;
      ret = nxsem_init(&adapter->not_full, 0, 0);
      if (ret >= 0)
        {
          adapter->not_full_initialized = true;
        }
      else
        {
          (void)nxsem_destroy(&adapter->not_empty);
          adapter->not_empty_initialized = false;
        }
    }

  if (ret < 0)
    {
      wlerr("ERROR: Failed to create queue semaphores: %d\n", ret);
      kmm_free(adapter->messages);
      kmm_free(adapter);
      return beken_errno_trans(ret);
    }

  *queue = adapter;

  return BK_OK;
}

bk_err_t rtos_push_to_queue(beken_queue_t *queue, void *message,
                            uint32_t timeout_ms)
{
  return bk7258_mq_push(queue, message, timeout_ms, false);
}

bk_err_t rtos_push_to_queue_front(beken_queue_t *queue, void *message,
                                  uint32_t timeout_ms)
{
  return bk7258_mq_push(queue, message, timeout_ms, true);
}

bk_err_t rtos_pop_from_queue(beken_queue_t *queue, void *message,
                             uint32_t timeout_ms)
{
  FAR struct mq_adpt_s *adapter;
  clock_t start;
  irqstate_t flags;
  bool wake;
  int ret;

  if (queue == NULL || *queue == NULL || message == NULL)
    {
      return BK_ERR_PARAM;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  start = clock_systime_ticks();

  for (; ; )
    {
      flags = spin_lock_irqsave(&adapter->lock);
      if (adapter->shutting_down)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-ESHUTDOWN);
        }

      if (adapter->count != 0)
        {
          memcpy(message,
                 adapter->messages + (size_t)adapter->head * adapter->msgsize,
                 adapter->msgsize);
          adapter->head = (adapter->head + 1u) % adapter->capacity;
          adapter->count--;
          wake = adapter->put_waiters != 0;
          spin_unlock_irqrestore(&adapter->lock, flags);
          ret = wake ? nxsem_post(&adapter->not_full) : OK;
          return beken_errno_trans(ret);
        }

      if (up_interrupt_context() || timeout_ms == 0)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EAGAIN);
        }

      if (adapter->get_waiters == UINT16_MAX)
        {
          spin_unlock_irqrestore(&adapter->lock, flags);
          return beken_errno_trans(-EOVERFLOW);
        }

      adapter->get_waiters++;
      spin_unlock_irqrestore(&adapter->lock, flags);
      ret = bk7258_mq_wait_hint(&adapter->not_empty, timeout_ms, start);
      flags = spin_lock_irqsave(&adapter->lock);
      adapter->get_waiters--;
      spin_unlock_irqrestore(&adapter->lock, flags);
      if (ret < 0)
        {
          return beken_errno_trans(ret);
        }
    }
}

bk_err_t rtos_deinit_queue(beken_queue_t *queue)
{
  FAR struct mq_adpt_s *adapter;
  irqstate_t flags;
  int ret;

  if (queue == NULL || *queue == NULL)
    {
      return BK_OK;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  flags = spin_lock_irqsave(&adapter->lock);
  if (adapter->get_waiters != 0 || adapter->put_waiters != 0)
    {
      spin_unlock_irqrestore(&adapter->lock, flags);
      return beken_errno_trans(-EBUSY);
    }

  /* Once teardown starts, no queue operation may resume.  Keep ownership of
   * each semaphore until its individual destroy succeeds so a rare partial
   * failure is retryable instead of double-destroying the first semaphore.
   */

  adapter->shutting_down = true;
  spin_unlock_irqrestore(&adapter->lock, flags);

  if (adapter->not_empty_initialized)
    {
      ret = nxsem_destroy(&adapter->not_empty);
      if (ret < 0)
        {
          return beken_errno_trans(ret);
        }

      adapter->not_empty_initialized = false;
    }

  if (adapter->not_full_initialized)
    {
      ret = nxsem_destroy(&adapter->not_full);
      if (ret < 0)
        {
          return beken_errno_trans(ret);
        }

      adapter->not_full_initialized = false;
    }

  kmm_free(adapter->messages);
  kmm_free(adapter);
  *queue = NULL;

  return BK_OK;
}

bool rtos_is_queue_empty(beken_queue_t *queue)
{
  FAR struct mq_adpt_s *adapter;
  irqstate_t flags;
  bool empty;

  if (queue == NULL || *queue == NULL)
    {
      return true;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  flags = spin_lock_irqsave(&adapter->lock);
  empty = adapter->count == 0;
  spin_unlock_irqrestore(&adapter->lock, flags);
  return empty;
}

bool rtos_is_queue_full(beken_queue_t *queue)
{
  FAR struct mq_adpt_s *adapter;
  irqstate_t flags;
  bool full;

  if (queue == NULL || *queue == NULL)
    {
      return false;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  flags = spin_lock_irqsave(&adapter->lock);
  full = adapter->count == adapter->capacity;
  spin_unlock_irqrestore(&adapter->lock, flags);
  return full;
}

bool rtos_reset_queue(beken_queue_t *queue)
{
  FAR struct mq_adpt_s *adapter;
  irqstate_t flags;
  uint16_t put_waiters;
  int ret = OK;

  if (queue == NULL || *queue == NULL || up_interrupt_context())
    {
      return false;
    }

  adapter = (FAR struct mq_adpt_s *)*queue;
  flags = spin_lock_irqsave(&adapter->lock);
  if (adapter->shutting_down)
    {
      spin_unlock_irqrestore(&adapter->lock, flags);
      return false;
    }

  adapter->head = 0;
  adapter->count = 0;
  put_waiters = adapter->put_waiters;
  spin_unlock_irqrestore(&adapter->lock, flags);

  /* Reset makes every slot available.  Wake blocked producers so each can
   * compete for a slot and recheck the authoritative count.  Consumer wake
   * hints already queued before reset are harmless because consumers also
   * recheck count; do not nxsem_reset() while tasks may be blocked on it.
   */

