open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
  while (put_waiters-- != 0 && ret >= 0)
    {
      ret = nxsem_post(&adapter->not_full);
    }

  return ret == OK;
}

/****************************************************************************
 * Public Functions - Event Flags
 ****************************************************************************/

bk_err_t rtos_init_event_flags(beken_event_t *event_flags)
{
  FAR nxevent_t *event;

  if (event_flags == NULL)
    {
      return BK_ERR_PARAM;
    }

  event = kmm_malloc(sizeof(*event));
  if (event == NULL)
    {
      return BK_FAIL;
    }

  nxevent_init(event, 0);
  *event_flags = event;

  return BK_OK;
}

beken_event_flags_t rtos_wait_for_event_flags(
    beken_event_t *event_flags,
    uint32_t flags_to_wait_for,
    beken_bool_t clear_set_flags,
    beken_event_flags_wait_option_t wait_option,
    uint32_t timeout_ms)
{
  FAR nxevent_t *event;
  nxevent_flags_t flags = 0;
  nxevent_mask_t result;

  if (event_flags == NULL || *event_flags == NULL ||
      flags_to_wait_for == 0)
    {
      return 0;
    }

  event = (FAR nxevent_t *)*event_flags;

  if (wait_option == WAIT_FOR_ALL_EVENTS)
    {
      flags |= NXEVENT_WAIT_ALL;
    }

  if (!clear_set_flags)
    {
      flags |= NXEVENT_WAIT_NOCLEAR;
    }

  if (timeout_ms == BEKEN_WAIT_FOREVER)
    {
      result = nxevent_wait(event, flags_to_wait_for, flags);
    }
  else if (timeout_ms == 0)
    {
      result = nxevent_trywait(event, flags_to_wait_for, flags);
    }
  else
    {
      result = nxevent_tickwait(event, flags_to_wait_for, flags,
                                MSEC2TICK(timeout_ms));
    }

  return (beken_event_flags_t)result;
}

void rtos_set_event_flags(beken_event_t *event_flags,
                          uint32_t flags_to_set)
{
  FAR nxevent_t *event;

  if (event_flags == NULL || *event_flags == NULL || flags_to_set == 0)
    {
      return;
    }

  event = (FAR nxevent_t *)*event_flags;
  (void)nxevent_post(event, flags_to_set, NXEVENT_POST_ALL);
}

beken_event_flags_t rtos_clear_event_flags(beken_event_t *event_flags,
                                           uint32_t flags_to_clear)
{
  FAR nxevent_t *event;

  if (event_flags == NULL || *event_flags == NULL)
    {
      return 0;
    }

  event = (FAR nxevent_t *)*event_flags;
  return (beken_event_flags_t)nxevent_clear(event, flags_to_clear);
}

beken_event_flags_t rtos_sync_event_flags(beken_event_t *event_flags,
                                          uint32_t flags_to_set,
                                          uint32_t flags_to_wait_for,
                                          uint32_t timeout_ms)
{
  FAR nxevent_t *event;
  nxevent_mask_t result;

  if (event_flags == NULL || *event_flags == NULL ||
      flags_to_wait_for == 0)
    {
      return 0;
    }

  event = (FAR nxevent_t *)*event_flags;

  /* Keep the barrier bits live while nxevent_post() releases every existing
   * waiter.  The posting (last-arriving) task then observes the same mask;
   * clearing after its wait is safe because already released waiters retain
   * their matched result in their private wait objects.
   */

  (void)nxevent_post(event, flags_to_set, NXEVENT_POST_ALL);

  if (timeout_ms == BEKEN_WAIT_FOREVER)
    {
      result = nxevent_wait(event, flags_to_wait_for,
                            NXEVENT_WAIT_ALL | NXEVENT_WAIT_NOCLEAR);
    }
  else if (timeout_ms == 0)
    {
      result = nxevent_trywait(event, flags_to_wait_for,
                               NXEVENT_WAIT_ALL | NXEVENT_WAIT_NOCLEAR);
    }
  else
    {
      result = nxevent_tickwait(event, flags_to_wait_for,
                                NXEVENT_WAIT_ALL | NXEVENT_WAIT_NOCLEAR,
                                MSEC2TICK(timeout_ms));
    }

  if ((result & flags_to_wait_for) == flags_to_wait_for)
    {
      (void)nxevent_clear(event, flags_to_wait_for);
    }

  return (beken_event_flags_t)result;
}

bk_err_t rtos_deinit_event_flags(beken_event_t *event_flags)
{
  FAR nxevent_t *event;
  int ret;

  if (event_flags == NULL || *event_flags == NULL)
    {
      return BK_ERR_PARAM;
    }

  event = (FAR nxevent_t *)*event_flags;
  ret = nxevent_destroy(event);
  if (ret < 0)
    {
      return BK_FAIL;
    }

  kmm_free(event);
  *event_flags = NULL;

  return BK_OK;
}

/****************************************************************************
 * Public Functions - Timer
 ****************************************************************************/

bk_err_t rtos_init_timer(beken_timer_t *timer, uint32_t time_ms,
                         timer_handler_t function, void *arg)
{
  struct timer_adpt *timer_apt;
  int ret;

  if (timer == NULL)
    {
      return BK_FAIL;
    }

  ret = bk7258_timer_service_initialize();
  if (ret < 0)
    {
      wlerr("ERROR: Failed to create SDK timer service: %d\n", ret);
      return BK_FAIL;
    }

  timer_apt = kmm_zalloc(sizeof(struct timer_adpt));
  if (!timer_apt)
    {
      wlerr("ERROR: Failed to malloc struct timer_adpt\n");
      return BK_FAIL;
    }

  memset(timer, 0x0, sizeof(beken_timer_t));

  timer_apt->delay  = MSEC2TICK(time_ms);
  timer_apt->priv   = timer;
  timer_apt->repeat = true;

  timer->handle   = timer_apt;
  timer->function = function;
  timer->arg      = arg;

  return BK_OK;
}

bk_err_t rtos_start_timer(beken_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;
  int ret = -EINVAL;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      timer_apt->enabled = true;
      if (timer_apt->queued || timer_apt->callback_running)
        {
          if (WDOG_ISACTIVE(&timer_apt->wdog))
            {
              (void)wd_cancel(&timer_apt->wdog);
            }

          timer_apt->restart_pending = true;
          ret = OK;
        }
      else
        {
          ret = bk7258_timer_start_locked(timer_apt);
        }
    }

  leave_critical_section(flags);

  if (ret != OK)
    {
      wlerr("ERROR: Failed to start timer:%d\n", ret);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_stop_timer(beken_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      timer_apt->enabled = false;
      timer_apt->deliver_pending = false;
      timer_apt->restart_pending = false;
      if (WDOG_ISACTIVE(&timer_apt->wdog))
        {
          (void)wd_cancel(&timer_apt->wdog);
        }
    }

  leave_critical_section(flags);
  return BK_OK;
}

