open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
bk_err_t rtos_reload_timer(beken_timer_t *timer)
{
  bk_err_t ret;

  (void)rtos_stop_timer(timer);
  ret = rtos_start_timer(timer);
  return ret;
}

bk_err_t rtos_deinit_timer(beken_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  if (timer == NULL)
    {
      return BK_OK;
    }

  flags = enter_critical_section();
  timer_apt = timer->handle;
  if (timer_apt != NULL)
    {
      /* Detach first, exactly as the official wrapper does before it queues
       * xTimerDelete().  The service owns the final free so self-deinit from
       * a callback cannot reinsert or free a live NuttX watchdog node.
       */

      timer->handle = NULL;
      bk7258_timer_delete_locked(timer_apt);
    }

  leave_critical_section(flags);

  return BK_OK;
}

bool rtos_is_timer_init(beken_timer_t *timer)
{
  irqstate_t flags;
  bool initialized;

  flags = enter_critical_section();
  initialized = timer != NULL && timer->handle != NULL;
  leave_critical_section(flags);
  return initialized;
}

bool rtos_is_timer_running(beken_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;
  bool running = false;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      running = timer_apt->enabled;
    }

  leave_critical_section(flags);
  return running;
}

bk_err_t rtos_init_oneshot_timer(beken2_timer_t *timer, uint32_t time_ms,
                                 timer_2handler_t function,
                                 void *larg, void *rarg)
{
  struct timer_adpt *timer_apt;
  int ret;

  if (timer == NULL)
    {
      return BK_FAIL;
    }

  ret = bk7258_timer_service_initialize();
  if (ret < 0)
    {
      wlerr("ERROR: Failed to create SDK timer service: %d\n", ret);
      return BK_FAIL;
    }

  timer_apt = kmm_zalloc(sizeof(struct timer_adpt));
  if (!timer_apt)
    {
      wlerr("ERROR: Failed to malloc struct timer_adpt\n");
      return BK_FAIL;
    }

  memset(timer, 0x0, sizeof(beken2_timer_t));

  timer_apt->delay  = MSEC2TICK(time_ms);
  timer_apt->priv   = timer;
  timer_apt->repeat = false;

  timer->handle   = timer_apt;
  timer->function = function;
  timer->left_arg = larg;
  timer->right_arg = rarg;
  timer->beken_magic = BEKEN_MAGIC_WORD;

  return BK_OK;
}

bk_err_t rtos_start_oneshot_timer(beken2_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;
  int ret = -EINVAL;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      timer_apt->enabled = true;
      if (timer_apt->queued || timer_apt->callback_running)
        {
          if (WDOG_ISACTIVE(&timer_apt->wdog))
            {
              (void)wd_cancel(&timer_apt->wdog);
            }

          timer_apt->restart_pending = true;
          ret = OK;
        }
      else
        {
          ret = bk7258_timer_start_locked(timer_apt);
        }
    }

  leave_critical_section(flags);

  if (ret != OK)
    {
      wlerr("ERROR: Failed to start timer:%d\n", ret);
    }

  return beken_errno_trans(ret);
}

bk_err_t rtos_stop_oneshot_timer(beken2_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      timer_apt->enabled = false;
      timer_apt->deliver_pending = false;
      timer_apt->restart_pending = false;
      if (WDOG_ISACTIVE(&timer_apt->wdog))
        {
          (void)wd_cancel(&timer_apt->wdog);
        }
    }

  leave_critical_section(flags);
  return BK_OK;
}

bk_err_t rtos_oneshot_reload_timer(beken2_timer_t *timer)
{
  bk_err_t ret;

  (void)rtos_stop_oneshot_timer(timer);
  ret = rtos_start_oneshot_timer(timer);
  return ret;
}

bk_err_t rtos_change_period(beken_timer_t *timer, uint32_t time_ms)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  (void)rtos_stop_timer(timer);
  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL)
    {
      timer_apt->delay = MSEC2TICK(time_ms);
    }

  leave_critical_section(flags);
  return timer_apt != NULL ? rtos_start_timer(timer) : BK_FAIL;
}

bk_err_t rtos_oneshot_reload_timer_ex(beken2_timer_t *timer,
                                      uint32_t time_ms,
                                      timer_2handler_t function,
                                      void *larg, void *rarg)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  (void)rtos_stop_oneshot_timer(timer);

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL)
    {
      timer_apt->delay  = MSEC2TICK(time_ms);
      timer_apt->priv   = timer;
      timer_apt->repeat = false;

      timer->function = function;
      timer->left_arg = larg;
      timer->right_arg = rarg;
      timer->beken_magic = BEKEN_MAGIC_WORD;
    }

  leave_critical_section(flags);

  return timer_apt != NULL ? rtos_start_oneshot_timer(timer) : BK_FAIL;
}

bk_err_t rtos_deinit_oneshot_timer(beken2_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;

  if (timer == NULL)
    {
      return BK_OK;
    }

  flags = enter_critical_section();
  timer_apt = timer->handle;
  if (timer_apt != NULL)
    {
      timer->handle = NULL;
      timer->function = NULL;
      timer->left_arg = NULL;
      timer->right_arg = NULL;
      timer->beken_magic = 0;
      bk7258_timer_delete_locked(timer_apt);
    }

  leave_critical_section(flags);

  return BK_OK;
}

bool rtos_is_oneshot_timer_running(beken2_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;
  bool running = false;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && !timer_apt->delete_pending)
    {
      running = timer_apt->enabled;
    }

  leave_critical_section(flags);
  return running;
}

bool rtos_is_oneshot_timer_init(beken2_timer_t *timer)
{
  irqstate_t flags;
  bool initialized;

  flags = enter_critical_section();
  initialized = timer != NULL && timer->handle != NULL;
  leave_critical_section(flags);
  return initialized;
}

uint32_t rtos_get_timer_expiry_time(beken_timer_t *timer)
{
  struct timer_adpt *timer_apt;
  irqstate_t flags;
  uint32_t remaining = 0;

  flags = enter_critical_section();
  timer_apt = timer != NULL ? timer->handle : NULL;
  if (timer_apt != NULL && WDOG_ISACTIVE(&timer_apt->wdog))
    {
      remaining = (uint32_t)wd_gettime(&timer_apt->wdog);
    }

  leave_critical_section(flags);
  return remaining;
}

#if defined(CONFIG_BK7258_WIFI_VNET) && !defined(CONFIG_BK7258_AP_CORE)
static bool g_bk7258_wifi_zero_malloc;
static bool g_bk7258_wifi_malloc_failure_logged;
static pid_t g_bk7258_wifi_malloc_owner_pid;

extern void *__real_malloc(size_t size);

void *__wrap_malloc(size_t size)
{
  void *mem = __real_malloc(size);

  if (mem == NULL &&
      !__atomic_exchange_n(&g_bk7258_wifi_malloc_failure_logged, true,
                           __ATOMIC_RELAXED))
    {
      struct mallinfo info = mallinfo();

