open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
      syslog(LOG_ERR,
             "BK7258 WIFI MALLOC FAIL pid=%ld size=%lu total=%lu "
             "used=%lu free=%lu maxfree=%lu\n",
             (long)nxsched_gettid(), (unsigned long)size,
             (unsigned long)info.arena, (unsigned long)info.uordblks,
             (unsigned long)info.fordblks, (unsigned long)info.mxordblk);
    }

  /* The official v3.1.1.9 CP starts Wi-Fi against a fresh, zero-filled
   * FreeRTOS heap.  Some of its Wi-Fi objects, including the station table,
   * use malloc() and consume embedded list heads as the previous state
   * without first clearing the allocation.  NuttX starts Wi-Fi later, so a
   * returned block can contain payload left by an earlier allocation.
   * Preserve the official startup contract only for the thread executing
   * bk_wifi_init().  Other CP threads retain normal NuttX malloc semantics
   * even while that short initialization window is active.
   */

  if (mem != NULL &&
      __atomic_load_n(&g_bk7258_wifi_zero_malloc, __ATOMIC_ACQUIRE) &&
      __atomic_load_n(&g_bk7258_wifi_malloc_owner_pid,
                      __ATOMIC_RELAXED) == nxsched_gettid())
    {
      memset(mem, 0, size);
    }

  return mem;
}

void bk7258_os_wifi_malloc_zero_begin(void)
{
  __atomic_store_n(&g_bk7258_wifi_malloc_owner_pid, nxsched_gettid(),
                   __ATOMIC_RELAXED);
  __atomic_store_n(&g_bk7258_wifi_zero_malloc, true, __ATOMIC_RELEASE);
}

void bk7258_os_wifi_malloc_zero_end(void)
{
  __atomic_store_n(&g_bk7258_wifi_zero_malloc, false, __ATOMIC_RELEASE);
  __atomic_store_n(&g_bk7258_wifi_malloc_owner_pid, 0,
                   __ATOMIC_RELAXED);
}
#endif

#ifdef CONFIG_BK7258_SDK_SRAM_HEAP
static uint8_t g_bk7258_sdk_sram_heap_area
  [CONFIG_BK7258_SDK_SRAM_HEAP_SIZE] __attribute__((aligned(32)));
static FAR struct mm_heap_s *g_bk7258_sdk_sram_heap;
static bool g_bk7258_sdk_sram_reject_logged;

static bool bk7258_os_sram_heap_contains(FAR const void *ptr)
{
  uintptr_t address = (uintptr_t)ptr;
  uintptr_t start = (uintptr_t)g_bk7258_sdk_sram_heap_area;

  return address >= start && address < start +
         sizeof(g_bk7258_sdk_sram_heap_area);
}

int bk7258_os_sram_heap_initialize(void)
{
  if (g_bk7258_sdk_sram_heap != NULL)
    {
      return OK;
    }

  g_bk7258_sdk_sram_heap = mm_initialize(
    "bk-sdk-sram", g_bk7258_sdk_sram_heap_area,
    sizeof(g_bk7258_sdk_sram_heap_area));
  return g_bk7258_sdk_sram_heap != NULL ? OK : -ENOMEM;
}
#endif

/* Memory functions — provided here for NuttX (libbk_rtos.a excluded to
 * avoid FreeRTOS-based implementations conflicting with ours). */

#ifdef CONFIG_BK7258_BT_IPC
static bool bk7258_os_bt_heap_call(const char *func_name)
{
  return func_name != NULL && strncmp(func_name, "bt_ipc_", 7) == 0;
}

static void bk7258_os_bt_heap_alloc(void *pointer, size_t size,
                                    uint32_t line)
{
  struct bk7258_bt_heap_track_entry_s *entry = NULL;
  struct bk7258_bt_heap_track_entry_s *free_entry = NULL;
  irqstate_t flags;
  uint32_t sequence;
  unsigned int i;
  bool duplicate = false;

  if (pointer == NULL)
    {
      return;
    }

  flags = enter_critical_section();
  sequence = ++g_bk7258_bt_heap_track.sequence;

  for (i = 0; i < BK7258_BT_HEAP_TRACK_SLOTS; i++)
    {
      struct bk7258_bt_heap_track_entry_s *candidate =
        &g_bk7258_bt_heap_track.entries[i];

      if (candidate->active && candidate->pointer == pointer)
        {
          entry = candidate;
          duplicate = true;
          break;
        }

      if (!candidate->active &&
          (free_entry == NULL || candidate->pointer == pointer))
        {
          free_entry = candidate;
          if (candidate->pointer == pointer)
            {
              /* Prefer the previous slot for the same recycled address. */

              continue;
            }
        }
    }

  if (entry == NULL)
    {
      entry = free_entry;
    }

  if (entry != NULL)
    {
      if (!entry->active)
        {
          g_bk7258_bt_heap_track.active++;
          if (g_bk7258_bt_heap_track.active >
              g_bk7258_bt_heap_track.high_water)
            {
              g_bk7258_bt_heap_track.high_water =
                g_bk7258_bt_heap_track.active;
            }
        }

      entry->pointer = pointer;
      entry->size = (uint32_t)size;
      entry->alloc_line = line;
      entry->free_line = 0;
      entry->alloc_sequence = sequence;
      entry->free_sequence = 0;
      entry->active = true;
    }

  if (duplicate)
    {
      g_bk7258_bt_heap_track.duplicate_allocations++;
    }

  leave_critical_section(flags);

  if (duplicate)
    {
      wlerr("ERROR: BT IPC duplicate allocation %p at line %" PRIu32 "\n",
            pointer, line);
    }
}

static bool bk7258_os_bt_heap_free(void *pointer, uint32_t line)
{
  struct bk7258_bt_heap_track_entry_s *entry = NULL;
  irqstate_t flags;
  uint32_t sequence;
  unsigned int i;

  if (pointer == NULL)
    {
      return true;
    }

  flags = enter_critical_section();
  sequence = ++g_bk7258_bt_heap_track.sequence;

  for (i = 0; i < BK7258_BT_HEAP_TRACK_SLOTS; i++)
    {
      if (g_bk7258_bt_heap_track.entries[i].active &&
          g_bk7258_bt_heap_track.entries[i].pointer == pointer)
        {
          entry = &g_bk7258_bt_heap_track.entries[i];
          break;
        }
    }

  if (entry != NULL)
    {
      entry->free_line = line;
      entry->free_sequence = sequence;
      entry->active = false;
      g_bk7258_bt_heap_track.active--;
      leave_critical_section(flags);
      return true;
    }

  g_bk7258_bt_heap_track.invalid_frees++;
  g_bk7258_bt_heap_track.last_invalid_pointer = pointer;
  g_bk7258_bt_heap_track.last_invalid_line = line;
  leave_critical_section(flags);

  wlerr("ERROR: Refusing stale BT IPC free %p at line %" PRIu32 "\n",
        pointer, line);
  return false;
}
#endif

void *os_malloc(size_t size)
{
  void *p = kmm_malloc(size);
  if (!p)
    {
      wlerr("ERROR: Failed to malloc %zu\n", size);
    }

  return p;
}

void os_free(void *ptr)
{
#ifdef CONFIG_BK7258_SDK_SRAM_HEAP
  if (bk7258_os_sram_heap_contains(ptr))
    {
      mm_free(g_bk7258_sdk_sram_heap, ptr);
      return;
    }
#endif

#ifdef CONFIG_BK7258_PSRAM
  if (bk7258_psram_address(ptr))
    {
      /* A role-local PSRAM block may be transferred permanently to the
       * NuttX system heap as a second region.  Its allocations still have
       * PSRAM addresses, but their metadata belongs to NuttX rather than
       * the enclosing private PSRAM heap.
       */

      if (bk7258_psram_system_heap_contains(ptr))
        {
          kmm_free(ptr);
        }
      else if (bk7258_psram_heap_contains(ptr))
        {
          bk7258_psram_free(ptr);
        }
      else
        {
          wlerr("ERROR: Refusing foreign PSRAM free %p\n", ptr);
        }

      return;
    }
#endif

