open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
  kmm_free(ptr);
}

void *os_zalloc(size_t size)
{
  return kmm_zalloc(size);
}

void *os_sram_malloc(size_t size)
{
  void *ptr = NULL;

#ifdef CONFIG_BK7258_SDK_SRAM_HEAP
  if (g_bk7258_sdk_sram_heap != NULL)
    {
      ptr = mm_malloc(g_bk7258_sdk_sram_heap, size);
      if (ptr != NULL)
        {
          return ptr;
        }
    }
#endif

  ptr = kmm_malloc(size);
#if defined(CONFIG_BK7258_SDK_SRAM_HEAP) && defined(CONFIG_BK7258_PSRAM)
  if (bk7258_psram_address(ptr))
    {
      kmm_free(ptr);
      if (!g_bk7258_sdk_sram_reject_logged)
        {
          g_bk7258_sdk_sram_reject_logged = true;
          wlerr("ERROR: Refusing SDK SRAM allocation from PSRAM size=%zu\n",
                size);
        }

      return NULL;
    }
#endif

  return ptr;
}

void *os_sram_calloc(size_t a, size_t b)
{
  size_t size;
  void *ptr;

  if (b != 0 && a > SIZE_MAX / b)
    {
      return NULL;
    }

  size = a * b;
  ptr = os_sram_malloc(size);
  if (ptr != NULL)
    {
      memset(ptr, 0, size);
    }

  return ptr;
}

void *os_sram_zalloc(size_t size)
{
  return os_sram_calloc(1, size);
}

void *os_realloc(void *ptr, size_t size)
{
#ifdef CONFIG_BK7258_SDK_SRAM_HEAP
  if (bk7258_os_sram_heap_contains(ptr))
    {
      return mm_realloc(g_bk7258_sdk_sram_heap, ptr, size);
    }
#endif

#ifdef CONFIG_BK7258_PSRAM
  if (bk7258_psram_address(ptr))
    {
      if (bk7258_psram_system_heap_contains(ptr))
        {
          return kmm_realloc(ptr, size);
        }

      return bk7258_psram_realloc(ptr, size);
    }
#endif

  return kmm_realloc(ptr, size);
}

void *psram_malloc(size_t size)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_malloc(size);
#else
  return kmm_malloc(size);
#endif
}

void *psram_zalloc(size_t size)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_zalloc(size);
#else
  return kmm_zalloc(size);
#endif
}

void *psram_realloc(void *ptr, size_t size)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_realloc(ptr, size);
#else
  return kmm_realloc(ptr, size);
#endif
}

void *bk_psram_realloc(void *ptr, size_t size)
{
  return psram_realloc(ptr, size);
}

void *os_malloc_debug(const char *func_name, int line, size_t size,
                      int need_zero)
{
  void *pointer;

  pointer = need_zero ? kmm_zalloc(size) : kmm_malloc(size);
#ifdef CONFIG_BK7258_BT_IPC
  if (bk7258_os_bt_heap_call(func_name))
    {
      bk7258_os_bt_heap_alloc(pointer, size, (uint32_t)line);
    }
#else
  (void)func_name;
  (void)line;
#endif

  return pointer;
}

void *os_sram_malloc_debug(const char *func_name, int line, size_t size,
                           int need_zero)
{
  (void)func_name;
  (void)line;

  return need_zero ? os_sram_zalloc(size) : os_sram_malloc(size);
}

void *psram_malloc_debug(const char *func_name, int line, size_t size,
                         int need_zero)
{
  (void)func_name;
  (void)line;

  return need_zero ? psram_zalloc(size) : psram_malloc(size);
}

void *os_free_debug(const char *func_name, int line, void *ptr)
{
#ifdef CONFIG_BK7258_BT_IPC
  if (bk7258_os_bt_heap_call(func_name) &&
      !bk7258_os_bt_heap_free(ptr, (uint32_t)line))
    {
      return NULL;
    }
#else
  (void)func_name;
  (void)line;
#endif

  os_free(ptr);
  return NULL;
}

void os_dump_memory_stats(uint32_t start_tick, uint32_t ticks_since_malloc,
                          const char *task)
{
  (void)start_tick;
  (void)ticks_since_malloc;
  (void)task;
}

void *os_malloc_wifi_buffer(size_t size)
{
  return kmm_malloc(size);
}

uint32_t bk_psram_heap_get_used_count(void)
{
#ifdef CONFIG_BK7258_PSRAM
  return (uint32_t)bk7258_psram_used_size();
#else
  return 0;
#endif
}

void bk_psram_heap_get_used_state(void)
{
}

void bk_psram_heap_dump_data(void)
{
}

INT32 os_memcmp(const void *s1, const void *s2, UINT32 n)
{
  return memcmp(s1, s2, (unsigned int)n);
}

void *os_memmove(void *out, const void *in, UINT32 n)
{
  return memmove(out, in, n);
}

void *os_memcpy(void *out, const void *in, UINT32 n)
{
  return memcpy(out, in, n);
}

int os_memcmp_const(const void *a, const void *b, size_t len)
{
  return memcmp(a, b, len);
}

void *os_memset(void *b, int c, UINT32 len)
{
  return (void *)memset(b, c, (unsigned int)len);
}

/****************************************************************************
 * Public Functions - String
 ****************************************************************************/

UINT32 os_strlen(const char *str)
{
  return (UINT32)strlen(str);
}

INT32 os_strcmp(const char *s1, const char *s2)
{
  return (INT32)strcmp(s1, s2);
}

INT32 os_strncmp(const char *s1, const char *s2, const UINT32 n)
{
  return (INT32)strncmp(s1, s2, (size_t)n);
}

INT32 os_snprintf(char *buf, UINT32 size, const char *fmt, ...)
{
  va_list ap;
  INT32 ret;

  va_start(ap, fmt);
  ret = (INT32)vsnprintf(buf, (size_t)size, fmt, ap);
  va_end(ap);

  return ret;
}

INT32 os_vsnprintf(char *buf, UINT32 size, const char *fmt, va_list ap)
{
  return (INT32)vsnprintf(buf, (size_t)size, fmt, ap);
}

char *os_strncpy(char *out, const char *in, const UINT32 n)
{
  return strncpy(out, in, (size_t)n);
}

UINT32 os_strtoul(const char *nptr, char **endptr, int base)
{
  return (UINT32)strtoul(nptr, endptr, base);
}

char *os_strcpy(char *out, const char *in)
{
  return strcpy(out, in);
}

char *os_strchr(const char *s, int c)
{
  return strchr(s, c);
}

char *os_strdup(const char *s)
{
  size_t len;
  char *d;

  if (s == NULL)
    {
      return NULL;
    }

  len = strlen(s) + 1;
  d = kmm_malloc(len);
  if (d == NULL)
    {
      return NULL;
    }

  memcpy(d, s, len);

  return d;
}

int os_strcasecmp(const char *s1, const char *s2)
{
  return strcasecmp(s1, s2);
}

int os_strncasecmp(const char *s1, const char *s2, size_t n)
{
  return strncasecmp(s1, s2, n);
}

char *os_strrchr(const char *s, int c)
{
  return strrchr(s, c);
}

char *os_strstr(const char *haystack, const char *needle)
{
  return strstr(haystack, needle);
}

size_t os_strlcpy(char *dest, const char *src, size_t siz)
{
  return strlcpy(dest, src, siz);
}

/****************************************************************************
 * Public Functions - Delay
 ****************************************************************************/

bk_err_t rtos_delay_milliseconds(uint32_t num_ms)
{
  bk7258_os_delay_ms(num_ms);
  return BK_OK;
}

