open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
/* The v3.1.1.9 PWM driver calls the bk_system delay_ms() ABI directly
 * instead of going through rtos_delay_milliseconds().  Keep both entry
 * points on the same NuttX-aware implementation so early boot/ISR callers
 * busy-wait while normal task-context callers yield the CPU.
 */

void delay_ms(uint32_t num_ms)
{
  bk7258_os_delay_ms(num_ms);
}

/****************************************************************************
 * Public Functions - Scheduler / System
 ****************************************************************************/

bool rtos_is_in_interrupt_context(void)
{
  return up_interrupt_context();
}

/* The v3.1.1.9 CM33 FreeRTOS port exports this lower-level spelling in
 * addition to rtos_is_in_interrupt_context().  Media controller archives
 * call it directly when deciding whether power/clock operations may block. */

uint32_t platform_is_in_interrupt_context(void)
{
  return up_interrupt_context() ? 1u : 0u;
}

bool rtos_local_irq_disabled(void)
{
  uint32_t basepri;
  uint32_t primask;

  __asm volatile ("mrs %0, primask" : "=r" (primask) :: "memory");
  __asm volatile ("mrs %0, basepri" : "=r" (basepri) :: "memory");
  return (primask & 1u) != 0 || basepri != 0;
}

bool rtos_is_scheduler_suspended(void)
{
  /* Stub - assume not suspended */

  return false;
}

bool rtos_is_scheduler_started(void)
{
  return OSINIT_IDLELOOP();
}

char *rtos_get_name(void)
{
  return "NuttX";
}

char *rtos_get_version(void)
{
  return "1.x";
}

void rtos_start_scheduler(void)
{
  /* NuttX scheduler is already running */
}

void rtos_shutdown(void)
{
  up_irq_disable();
  for (; ; );
}

/****************************************************************************
 * Public Functions - Heap Info
 ****************************************************************************/

size_t rtos_get_total_heap_size(void)
{
  struct mallinfo info;

  info = kmm_mallinfo();

  return (info.fordblks + info.uordblks);
}

size_t rtos_get_free_heap_size(void)
{
  struct mallinfo info;

  info = kmm_mallinfo();

  return info.fordblks;
}

size_t rtos_get_minimum_free_heap_size(void)
{
  struct mallinfo info;

  info = kmm_mallinfo();

  return (info.fordblks + info.uordblks - info.usmblks);
}

size_t rtos_get_psram_total_heap_size(void)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_total_size();
#else
  return 0;
#endif
}

size_t rtos_get_psram_free_heap_size(void)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_free_size();
#else
  return 0;
#endif
}

size_t rtos_get_psram_minimum_free_heap_size(void)
{
#ifdef CONFIG_BK7258_PSRAM
  return bk7258_psram_minimum_free_size();
#else
  return 0;
#endif
}

/* libos_source.a remains excluded; the N14 board heap supplies the SDK
 * psram statistics ABI above.
 */

/****************************************************************************
 * Public Functions - Scheduler Lock (FreeRTOS vTaskSuspendAll equivalent)
 ****************************************************************************/

void vTaskSuspendAll(void)
{
  sched_lock();
}

int xTaskResumeAll(void)
{
  sched_unlock();
  return 1;
}

/****************************************************************************
 * Public Functions - Logging Stubs
 *
 * The SDK logging macros (BK_LOGI/W/E) call bk_printf_ext() and
 * bk_printf_raw().  Provide NuttX-backed implementations.
 ****************************************************************************/

static bool bk7258_sdk_log_is_sensitive(const char *fmt)
{
  return fmt != NULL &&
         (strstr(fmt, "password") != NULL ||
          strstr(fmt, "Password") != NULL ||
          strstr(fmt, "ssid") != NULL ||
          strstr(fmt, "SSID") != NULL ||
          strstr(fmt, "psk") != NULL ||
          strstr(fmt, "PSK") != NULL);
}

static bool bk7258_sdk_log_allowed(const char *fmt)
{
  /* SDK interrupts may run above the NuttX syscall interrupt-priority
   * ceiling.  Such handlers must not enter the synchronous NuttX syslog
   * backend: an interrupt can otherwise preempt a task while the RPMsg
   * syslog spinlock is held and deadlock trying to acquire the same lock.
   * Drop interrupt-context SDK diagnostics; normal task-context logs retain
   * the existing NuttX syslog path.
   */

  return g_bk7258_sdk_printf_enabled &&
         !up_interrupt_context() &&
         !bk7258_sdk_log_is_sensitive(fmt);
}

int bk_printf_init(void)
{
  /* 日志已由 NuttX 启动流程初始化，下面的 SDK 输出入口直接使用 syslog。
   * 不再启动 FreeRTOS printf 锁或重新配置已由 NuttX 占用的控制台 UART。
   */

  return OK;
}

void bk_printf_ext(int level, char *tag, const char *fmt, ...)
{
  va_list ap;

  if (!bk7258_sdk_log_allowed(fmt))
    {
      return;
    }

  (void)level;

  if (tag)
    {
      syslog(LOG_INFO, "[%s] ", tag);
    }

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_vprintf_ext(int level, char *tag, const char *fmt, va_list ap)
{
  if (!bk7258_sdk_log_allowed(fmt))
    {
      return;
    }

  (void)level;

  if (tag)
    {
      syslog(LOG_INFO, "[%s] ", tag);
    }

  vsyslog(LOG_INFO, fmt, ap);
}

char *vTaskName(void)
{
  return (char *)getprogname();
}

/* The official PSRAM driver uses the early/static logging entry point while
 * it is bringing the controller up.  NuttX syslog is already synchronous,
 * so its wrapper has the same behavior as bk_printf_ext().
 */

void bk_printf_static_block(int level, char *tag, const char *fmt, ...)
{
  va_list ap;

  if (!bk7258_sdk_log_allowed(fmt))
    {
      return;
    }

  (void)level;

  if (tag)
    {
      syslog(LOG_INFO, "[%s] ", tag);
    }

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_printf_raw(int level, char *tag, const char *fmt, ...)
{
  va_list ap;

  if (!bk7258_sdk_log_allowed(fmt))
    {
      return;
    }

  (void)level;
  (void)tag;

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_printf(const char *fmt, ...)
{
  va_list ap;

  if (!bk7258_sdk_log_allowed(fmt))
    {
      return;
    }

  va_start(ap, fmt);
  vsyslog(LOG_INFO, fmt, ap);
  va_end(ap);
}

void bk_null_printf(const char *fmt, ...)
{
  /* Intentionally empty - suppress output */
}

void bk_set_printf_enable(uint8_t enable)
{
  g_bk7258_sdk_printf_enabled = enable != 0;
}

/* NuttX syslog writes synchronously from these SDK adapter callbacks.  The
 * official implementation only changes its async-shell policy, which is not
 * present in this image, so the NuttX equivalent is deliberately a no-op and
 * always reports synchronous mode.
 */

void bk_set_printf_sync(uint8_t enable)
{
  (void)enable;
}

int bk_get_printf_sync(void)
{
  return 1;
}

int bk_get_printf_port(void)
{
#ifndef CONFIG_BK7258_AP_CORE
  return BK7258_NUTTX_CONSOLE_UART_PORT;
#else
  return CONFIG_UART_PRINT_PORT;
#endif
}

void bk_mem_dump(const char *title, uint32_t start, uint32_t len)
{
  /* Stub */
}

/****************************************************************************
 * Public Functions - Event Extended (rtos_ext.h)
 ****************************************************************************/

bk_err_t rtos_init_event_ex(rtos_event_ext_t *event)
{
  if (event == NULL)
    {
      return BK_ERR_NULL_PARAM;
    }

  if (event->event_semaphore != NULL)
    {
      return BK_OK;
    }

  event->event_flag = 0;
  return rtos_init_semaphore(&event->event_semaphore, 1);
}

bk_err_t rtos_deinit_event_ex(rtos_event_ext_t *event)
{
  bk_err_t ret;

  if (event == NULL)
    {
      return BK_ERR_NULL_PARAM;
    }

  ret = rtos_deinit_semaphore(&event->event_semaphore);
  if (ret == BK_OK)
    {
      event->event_flag = 0;
    }

  return ret;
}

