open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/common/bk7258_os_adapt.c
bk_err_t rtos_set_event_ex(rtos_event_ext_t *event, u32 event_flag)
{
  uint32_t int_level;

  if (event == NULL || event->event_semaphore == NULL)
    {
      return BK_ERR_NOT_INIT;
    }

  if (event_flag == 0)
    {
      return BK_OK;
    }

  /* The SDK permits this entry point from an ISR and serializes the shared
   * flag word with its SMP critical lock before posting the waiter. */

  int_level = rtos_enter_critical();
  event->event_flag |= event_flag;
  rtos_exit_critical(int_level);

  (void)rtos_set_semaphore(&event->event_semaphore);

  return BK_OK;
}

u32 rtos_wait_event_ex(rtos_event_ext_t *event, u32 event_flag,
                       u32 any_event, u32 timeout)
{
  uint32_t start;

  if (event == NULL || event->event_semaphore == NULL || event_flag == 0)
    {
      return 0;
    }

  start = rtos_get_time();
  for (;;)
    {
      uint32_t elapsed;
      uint32_t remaining;
      uint32_t int_level;
      u32 flags;

      /* Match the official SDK/Tuya event-group contract: observe flags
       * before blocking, distinguish ANY from ALL, and clear only the flags
       * actually returned to the single supported waiter. */

      int_level = rtos_enter_critical();
      flags = event->event_flag & event_flag;
      if (!any_event && flags != event_flag)
        {
          flags = 0;
        }
      event->event_flag &= ~flags;
      rtos_exit_critical(int_level);

      if (flags != 0)
        {
          return flags;
        }

      if (timeout == 0)
        {
          return 0;
        }

      if (timeout == BEKEN_WAIT_FOREVER)
        {
          remaining = BEKEN_WAIT_FOREVER;
        }
      else
        {
          /* Unsigned subtraction provides the required 32-bit millisecond
           * wrap handling. */

          elapsed = rtos_get_time() - start;
          if (elapsed >= timeout)
            {
              return 0;
            }

          remaining = timeout - elapsed;
        }

      if (rtos_get_semaphore(&event->event_semaphore, remaining) != BK_OK)
        {
          return 0;
        }
    }
}

/****************************************************************************
 * Public Functions - HISR (rtos_ext.h)
 ****************************************************************************/

bk_err_t rtos_create_hisr(rtos_hisr_cb_t *hisr_cb, high_isr_t hisr,
                          void *param, u32 hisr_id)
{
  if (!hisr_cb)
    {
      return BK_FAIL;
    }

  hisr_cb->hisr       = hisr;
  hisr_cb->hisr_param = param;
  hisr_cb->hisr_id    = hisr_id;
  hisr_cb->inited     = 1;

  return BK_OK;
}

bk_err_t rtos_activate_hisr(rtos_hisr_cb_t *hisr_cb)
{
  if (!hisr_cb || !hisr_cb->hisr)
    {
      return BK_FAIL;
    }

  hisr_cb->hisr(hisr_cb->hisr_param);

  return BK_OK;
}

void rtos_hisr_task(void *param)
{
  /* Stub - HISR runs inline in this adaptation */
}
